Documents/бит_ИсполнительныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ИсполнительныйЛист</Name>
			<BasedOn>
				<xr:Item>Document.бит_РешениеСуда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоИсполнительномуПроизводству</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>InformationRegister.ИсторияРаботыСДолжниками</xr:Item>
				<xr:Item>InformationRegister.ИсторияИсполнительныхЛистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВынесенияРешенияСуда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоИсполнительнымЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолгаПоУслугеПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаГоспошлиныПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПредставительскихРасходовПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>История</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсковоеЗаявление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатыПоИсполнительномуЛисту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОплатыКУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлины</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПредставительскихРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботаССППоИсполнительномуЛисту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРейда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРейда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПриставаПредставителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ответчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПоИсполнительнымЛистам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоИсполнительнымЛистам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПодписантыПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПодписантыПоИсполнительнымЛистам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПоИсполнительнымЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВОСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноНаправленВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноНаправленВОСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВИнуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченВСвязиСНевозможностьюВзыскания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненВПолномОбъеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСудом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВИФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкрот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленНаОписку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченПоАктуСписанияУК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПриостановлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВДепартаментФинансов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ИсполнительныйЛист/Ext/ManagerModule.bsl
#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.

//

// Параметры:

//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.

//

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_DOCX_Макет";
	КомандаПечати.Представление = НСтр("ru = 'Заявление по исполнительным листам (Word)'");
	КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;    
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_DOCX_Сопроводительное";
	КомандаПечати.Представление = НСтр("ru = 'Сопроводительное у заявлениям по исполнительным листам (Word)'");
	КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 2;    

КонецПроцедуры



Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_DOCX_Макет") Тогда
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ПФ_DOCX_Макет");
		Если ПечатнаяФорма <> Неопределено Тогда		
			ОфисныеДокументы = НапечататьЗаявление(МассивОбъектов);
			ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Печать заявления (Word)'");
			ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент();
		КонецЕсли;
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_DOCX_Сопроводительное") Тогда
		ПечатнаяФорма2 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ПФ_DOCX_Сопроводительное" );
		Если ПечатнаяФорма2 <> Неопределено Тогда
			//Для Каждого Объект Из МассивОбъектов Цикл
				//Формируются массивы ссылок для печати сопроводительных
				//МассивДляПечати = СформироватьМассивСсылокДляСопроводительного(Объект);
				
				ОфисныеДокументы = НапечататьСопроводительноеПисьмо(МассивОбъектов);
				ПечатнаяФорма2.СинонимМакета = НСтр("ru = 'Печать сопроводительного к заявлениям (Word)'");
				ПечатнаяФорма2.ОфисныеДокументы = ОфисныеДокументы;
				ПечатнаяФорма2.ТабличныйДокумент = Новый ТабличныйДокумент();
			//КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры     

Функция ПолучитьСсылкиНаДокументыПоОднойСсылке(МассивСоответствий, МассивОбъектов, СписокСтатусов)        
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИсполнительныйЛист.Ссылка КАК Ссылка,
	|	бит_ИсполнительныйЛист.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ИсполнительныйЛист.Статус КАК Статус
	|ИЗ
	|	Документ.бит_ИсполнительныйЛист КАК бит_ИсполнительныйЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних КАК СтатусыПоИсполнительнымЛистамСрезПоследних
	|		ПО (СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист = бит_ИсполнительныйЛист.Ссылка)
	|ГДЕ
	|	(бит_ИсполнительныйЛист.ЛицевойСчет.Здание = &Адрес
	|			ИЛИ &СодРем)
	|	И СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента В(&СтатусДокумента)
	|	И НАЧАЛОПЕРИОДА(бит_ИсполнительныйЛист.Дата, ДЕНЬ) = &Дата
	|	И бит_ИсполнительныйЛист.Услуга = &Услуга
	|ИТОГИ ПО
	|	Статус";  
	
	СодРемУслуга = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001");
	Запрос.УстановитьПараметр("Дата", НачалоДня(МассивОбъектов[0].Дата));
	Запрос.УстановитьПараметр("Адрес", МассивОбъектов[0].ЛицевойСчет.Здание);
	Запрос.УстановитьПараметр("СодРем", МассивОбъектов[0].Услуга = СодРемУслуга);                      
	Запрос.УстановитьПараметр("Услуга",  МассивОбъектов[0].Услуга);                      
	
	Запрос.УстановитьПараметр("СтатусДокумента", СписокСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаCтатус = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаCтатус.Следующий() Цикл    
		Выб = ВыборкаCтатус.Выбрать();
		МассивСсылок = Новый Массив();
		Пока Выб.Следующий() Цикл  
			МассивСсылок.Добавить(Выб.Ссылка);
		КонецЦикла;
		МассивСоответствий.Вставить(МассивОбъектов[0].Адрес + ВыборкаCтатус.Статус, МассивСсылок);
    КонецЦикла;
КонецФункции	    

Функция ПолучитьСсылкиНаДокументыПоСписку(МассивСоответствий, МассивОбъектов)        
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИсполнительныйЛист.Ссылка КАК Ссылка,
	|	бит_ИсполнительныйЛист.Услуга КАК Услуга,
	|	бит_ИсполнительныйЛист.ЛицевойСчет.Здание КАК ЛицевойСчетЗдание,
	|	ВЫБОР
	|		КОГДА бит_ИсполнительныйЛист.Услуга = &Содержание
	|			ТОГДА ""Содержание и ремонт""
	|		ИНАЧЕ бит_ИсполнительныйЛист.ЛицевойСчет.Здание
	|	КОНЕЦ КАК ПолеГруппировки,
	|	бит_ИсполнительныйЛист.Статус КАК Статус
	|ИЗ
	|	Документ.бит_ИсполнительныйЛист КАК бит_ИсполнительныйЛист
	|ГДЕ
	|	бит_ИсполнительныйЛист.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИсполнительныйЛист.Услуга,
	|	бит_ИсполнительныйЛист.Ссылка,
	|	бит_ИсполнительныйЛист.ЛицевойСчет.Здание
	|ИТОГИ ПО  
	|   Статус,
	|	Услуга,
	|	ПолеГруппировки";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("Содержание", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаCтатус = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаCтатус.Следующий() Цикл
		
		ВыборкаУслуга = ВыборкаCтатус.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			
			ВыборкаПолеГруппировки = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПолеГруппировки.Следующий() Цикл
				МассивСсылок = Новый массив();
				ВыборкаДетальныеЗаписи = ВыборкаПолеГруппировки.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
				КонецЦикла;    
				МассивСоответствий.Вставить(Строка(ВыборкаПолеГруппировки.ПолеГруппировки) + СТрока(ВыборкаПолеГруппировки.Статус) ,МассивСсылок);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецФункции
	
//Печать заявления
Функция НапечататьЗаявление(МассивОбъектов)
	МассивСоответствий = Новый Соответствие;
	Статусы = Новый Массив();
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВОСП); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВОСП); 
    МассивЗаявл = Новый Массив();
	МассивЗаявл.Добавить(МассивОбъектов[0]);
	ОфисныеДокументы = Новый Соответствие;
	Если  Статусы.Найти(МассивОбъектов[0].Статус) = Неопределено Тогда
		возврат ОфисныеДокументы;
	Иначе 
		МассивСоответствий.Вставить(МассивОбъектов[0].Адрес , МассивЗаявл);
	КонецЕсли;
	
	МакетДокумента = ПолучитьМакет("ПФ_DOCX_Макет");
	Шаблон = НСтр("ru = 'Заявление исп.лист №[Номер] от [Дата]'");
	
	Для Каждого ИсполнительныйЛист из МассивСоответствий Цикл
		Если ИсполнительныйЛист.Значение.Количество() = 0 Тогда  
			Продолжить;
		КонецЕсли;
		Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
		Если Макет = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		ОписаниеОбластей = Новый Структура;
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",         		   "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы",           "СтрокаТаблицы");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СчетКапРемонт",           "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Счет",           		   "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",         		   "Общая");
		
		ДанныеДляПечати = ПолучитьДанныеДляПечати(ИсполнительныйЛист.Значение,"ПФ_DOCX_Макет");
		ТЧДолжники = ДанныеДляПечати.ТЧДолжники;     
		Статус = ДанныеДляПечати.Статус;
		Услуга = ДанныеДляПечати.Услуга;
		ДатаДокумента = ДанныеДляПечати.ДатаДокумента;
		БанковскиеРеквизиты = ДанныеДляПечати.БанковскиеРеквизиты;
		
		ДанныеПоШапке = Новый Структура("КапРемонт,ШапкаКапРемонт,ТекущийГод","","");
		УслугаКапРемонт = КапитальныйРемонт(Услуга.Наименование);
		Если УслугаКапРемонт Тогда
			ДанныеПоШапке.Вставить("КапРемонт", "КАПИТАЛЬНЫЙ РЕМОНТ");
			ДанныеПоШапке.Вставить("ШапкаКапРемонт"," по взысканию задолженности по капитальному ремонту, вынесенный на основании решения мирового судьи в городе Омске Омской области");
		Иначе
			ДанныеПоШапке.Вставить("КапРемонт", "«СОДЕРЖАНИЕ И РЕМОНТ ОБЩЕГО ИМУЩЕСТВА»");
		КонецЕсли;                               
		ДанныеПоШапке.Вставить("ТекущийГод", Формат(ТекущаяДата(),"ДФ=yyyy"));
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат ОфисныеДокументы;
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеПоШапке);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СтрокаТаблицы"]);
		УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ТЧДолжники);
		
		Если УслугаКапРемонт Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СчетКапРемонт"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,БанковскиеРеквизиты);
		Иначе
			Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Счет"]);
			УправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, Область);
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,Подписант(ИсполнительныйЛист));
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		
		ИмяДокумента = "Заявление по исполнительному листу  " 
		+ Строка(ИсполнительныйЛист.Ключ) 
		+ " от " + Строка(Формат(ТекущаяДата(),"ДФ = дд.мм.гг")) 
		+  ".doc";
		ОфисныеДокументы.Вставить(АдресХранилищаПечатнойФормы,ИмяДокумента);
		
		УправлениеПечатью.ОчиститьСсылки(Макет);
	КонецЦикла;
	
	Возврат ОфисныеДокументы;
	
КонецФункции 

//Возвращает статус, соответствующий переданному
Функция ПолучитьСтатусСоответствия(Статус)
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВБанк, Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВБанк);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВБанк, Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВБанк);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВОСП, Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВОСП);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВОСП, Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВОСП);
	Возврат СоответствиеСтатусов.Получить(Статус);
КонецФункции

//Формирует массив ссылок на Исполнительные листы, которые будут напечатаны в одном сопроводительном письме
//Отбор по периоду: дата установки последнего статуса документа.
//Статусы: напр. "Направлен в ОСП" и "Повторно направлен в ОСП"
//При услуге "Кап.ремонт" добавляется отбор по одному зданию
//Функция СформироватьМассивСсылокДляСопроводительного(ОбъектПечати)
//	МассивСсылок = Новый Массив;
//		
//    //Параметры запроса
//	Период = ПолучитьДатуСтатуса(ОбъектПечати.Ссылка,ОбъектПечати.Статус);
//	Статус1 = ОбъектПечати.Статус;
//	Статус2 = ПолучитьСтатусСоответствия(Статус1);
//	Здание = ОбъектПечати.ЛицевойСчет.Здание;
//	Услуга = ОбъектПечати.Услуга;
//	
//	Запрос = Новый Запрос;
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	СтатусыПоИсполнительнымЛистамСрезПоследних.Период КАК Период,
//	|	СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист КАК ИсполнительныйЛист,
//	|	СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента КАК СтатусДокумента
//	|ИЗ
//	|	РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних(
//	|			,
//	|			(СтатусДокумента = &Статус1
//	|				ИЛИ СтатусДокумента = &Статус2)
//	|				И Период = &Период
//	|				И ИсполнительныйЛист.Услуга = &Услуга
//	|				//ОтборПоКапРемонту) КАК СтатусыПоИсполнительнымЛистамСрезПоследних";
//	
//	Если КапитальныйРемонт(Услуга.Наименование) Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборПоКапРемонту"," И ИсполнительныйЛист.ЛицевойСчет.Здание = &Здание");
//	Иначе 
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ОтборПоКапРемонту","");
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("Период", Период);
//	Запрос.УстановитьПараметр("Статус1", Статус1);
//	Запрос.УстановитьПараметр("Статус2", Статус2);
//	Запрос.УстановитьПараметр("Услуга", Услуга);
//	Запрос.УстановитьПараметр("Здание", Здание);
//	
//	Запрос.Текст = ТекстЗапроса;
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.ИсполнительныйЛист);
//	КонецЦикла;
//	Возврат МассивСсылок;
//КонецФункции

//Печать сопроводительного письма
Функция НапечататьСопроводительноеПисьмо(МассивСсылок)
	МассивСоответствий = Новый Соответствие;  
	Статусы = Новый Массив();
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВБанк); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВБанк); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.НаправленВОСП); 
	Статусы.Добавить(Перечисления.СтатусыПоИсполнительнымЛистам.ПовторноНаправленВОСП); 

	Если МассивСсылок.Количество() = 1 Тогда   
		ПолучитьСсылкиНаДокументыПоОднойСсылке(МассивСоответствий, МассивСсылок, Статусы);
	Иначе         
		ПолучитьСсылкиНаДокументыПоСписку(МассивСоответствий, МассивСсылок);
	КонецЕсли;
	
	ОфисныеДокументы = Новый Соответствие;
	МакетДокумента = ПолучитьМакет("ПФ_DOCX_Сопроводительное");
	Шаблон = НСтр("ru = 'Сопровод. письмо по заявлению исп.лист №[Номер] от [Дата]'");
	
	Индекс = 1;
	Для Каждого ИсполнительныйЛист из МассивСоответствий Цикл
		Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
		
		Если Макет = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		Если ИсполнительныйЛист.Значение.Количество() = 0 Тогда  
			Продолжить;
		КонецЕсли;
		
		ОписаниеОбластей = Новый Структура;
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",         		   "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы",           "СтрокаТаблицы");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СчетКапРемонт",           "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Счет",           		   "Общая");
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",         		   "Общая");
		
		ДанныеДляПечати = ПолучитьДанныеДляПечати(ИсполнительныйЛист.Значение,"ПФ_DOCX_Сопроводительное");
		
		ТЧДолжники = ДанныеДляПечати.ТЧДолжники;
		Статус = ДанныеДляПечати.Статус;
		Услуга = ДанныеДляПечати.Услуга;
		ДатаДокумента = ДанныеДляПечати.ДатаДокумента;
		
		//КоличествоЛистов = 0;       
		Текномер  = "";
		//Для Каждого  Стр Из  ИсполнительныйЛист.Значение Цикл      
		//	Если Текномер <> Стр.НомерИсполнительногоЛиста Тогда
		//		КоличествоЛистов = КоличествоЛистов + 1;   
		//		Текномер = Стр.НомерИсполнительногоЛиста;
		//	КонецЕсли;
		//КонецЦикла;
		
		ДанныеПоШапке = Новый Структура("ТекущийГод,Кому,КомуАдрес,КоличествоЛистов");
		ДанныеПоШапке.Вставить("ТекущийГод",Формат(ТекущаяДата(),"ДФ = гггг"));
		//ДанныеПоШапке.Вставить("КоличествоЛистов", ТЧДолжники.Количество());
		УслугаКапРемонт = КапитальныйРемонт(Услуга.Наименование);
		Если СтрНайти(нрег(Статус),"банк")>0 И НЕ УслугаКапРемонт Тогда     
			ДанныеПоШапке.Вставить("Кому","Омское отделение № 8634 ПАО «Сбербанк»");
			ДанныеПоШапке.Вставить("КомуАдрес","644 024, г. Омск, ул. Жукова, 4/1");
		ИначеЕсли СтрНайти(нрег(Статус),"банк")>0 И  УслугаКапРемонт Тогда     
			ДанныеПоШапке.Вставить("Кому",ДанныеДляПечати.БанковскиеРеквизиты.НаименованиеБанка);
			ДанныеПоШапке.Вставить("КомуАдрес",ДанныеДляПечати.БанковскиеРеквизиты.АдресБанка);
		ИначеЕсли СтрНайти(нрег(Статус),"в осп")>0 Тогда
			ДанныеПоШапке.Вставить("Кому","Начальнику ОСП_АО г. Омска");
			ДанныеПоШапке.Вставить("КомуАдрес","УФССП по Омской области");
		КонецЕсли;
		Если УслугаКапРемонт Тогда
			ДанныеПоШапке.Вставить("ШапкаКапРемонт"," (по капитальному ремонту)");
		Иначе
			ДанныеПоШапке.Вставить("ШапкаКапРемонт","");
		КонецЕсли;
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат ОфисныеДокументы;
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеПоШапке);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СтрокаТаблицы"]);
		УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ТЧДолжники);
		
		Если УслугаКапРемонт Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СчетКапРемонт"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,ДанныеДляПечати.БанковскиеРеквизиты);
		Иначе
			Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Счет"]);
			УправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, Область);
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма,Область,Подписант(ДатаДокумента));
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		
		ИмяДокумента = "Сопроводительное письмо по исполнительным листам " + Индекс +" от " + Строка(Формат(ТекущаяДата(),"ДФ = дд.мм.гг")) + ".docx"; 
		ОфисныеДокументы.Вставить(АдресХранилищаПечатнойФормы, ИмяДокумента);
		
		УправлениеПечатью.ОчиститьСсылки(Макет);    
		Индекс = Индекс + 1;

	КонецЦикла;
	
	Возврат ОфисныеДокументы;
	
КонецФункции 

Функция ПолучитьДанныеДляПечати(МассивСсылок,ИмяМакета)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса();
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//Заводим переменные для разбора результата
	ТЧДолжники = Новый Массив();
	БанковскиеРеквизиты = Новый Структура(
	"РасчетныйСчет,НаименованиеБанка,БИКБанка,КоррСчет,ИННБанка,ОКПОБанка,КППБанка,ОГРНБанка,АдресБанка");
	Статус = "";
	Услуга = "";
	ДатаДокумента = "";
	ГосПошлина = 0;
	ДатаВыдачиПриказа = "";
	ДатаВступВСилу = "";
	
	Индекс = 0;
	ВспомИндекс = 0;
	ТекущийЛицевой = Неопределено;  
	ТекущийНомерДокумента = "";
	СуммаГоспошлины = 0;   
	МассивСтрок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Индекс = 0 Тогда
			БанковскиеРеквизиты.РасчетныйСчет = Выборка.РасчетныйСчет;
			БанковскиеРеквизиты.НаименованиеБанка = Выборка.НаименованиеБанка;
			БанковскиеРеквизиты.БИКБанка = Выборка.БИК;
			БанковскиеРеквизиты.КоррСчет = Выборка.КоррСчет;
			БанковскиеРеквизиты.ИННБанка = Выборка.ИННБанка;
			БанковскиеРеквизиты.ОКПОБанка = Выборка.ОКПОБанка;
			БанковскиеРеквизиты.КППБанка = Выборка.КППБанка;
			БанковскиеРеквизиты.ОГРНБанка = Выборка.ОГРНБанка;
			БанковскиеРеквизиты.АдресБанка = Выборка.АдресБанка;
			
			Статус = Выборка.Статус;
			Услуга = Выборка.Услуга;
			ДатаДокумента = Формат(Выборка.ДатаДокумента,"ДФ = дд.ММ.гггг");
			ГосПошлина = Выборка.ГосПошлина;
		КонецЕсли; 
		ДатаВыдачиПриказа = Формат(Выборка.ДатаВыдачиПриказа,"ДФ = дд.ММ.гггг");
		ДатаВступВСилу = Формат(Выборка.ДатаВступВСилу,"ДФ = дд.ММ.гггг");
		АдресДолжника = Строка(Выборка.Здание) + ", " + Выборка.Квартира;
		//Заполняем основного должника из документа
		Если  ЗначениеЗаполнено(Выборка.ФИОДолжника) Тогда  
			ВспомИндекс = 1;   
			Индекс = Индекс + 1;

			СуммаЗадолженностиДляВывода = ?(Выборка.СуммаЗадолженности = 0, "Опл",Выборка.СуммаЗадолженности);
			ТЧДолжники.Добавить(Новый Структура("ФИОДолжника,АдресДолжника,СуммаЗадолженности,ПредставРасходы,ГосПошлина,НомерДокумента,ДатаВыдачиПриказа,ДатаВступВСилу,Ном",
			Выборка.ФИОДолжника,АдресДолжника,СуммаЗадолженностиДляВывода,
			Выборка.ПредставРасходы,Выборка.ГосПошлина,Выборка.НомерДокумента,ДатаВыдачиПриказа,ДатаВступВСилу,Строка(Индекс)));   
			СуммаГоспошлины = Выборка.ГосПошлина; 
			МассивСтрок.Добавить(ТЧДолжники[ТЧДолжники.Количество()-1]);
		КонецЕсли;

		
		
		ТЗДолжники = Выборка.Ответчики.Выгрузить(); 
		Для Каждого Должник ИЗ ТЗДолжники Цикл
			Если Должник.ФизЛицо <> Выборка.ФИОДолжника И ЗначениеЗаполнено(Должник.ФизЛицо) Тогда     
				Индекс = Индекс + 1;
				ВспомИндекс = ВспомИндекс + 1;
				СуммаЗадолженностиДляВывода = ?(Выборка.СуммаЗадолженности = 0, "Опл",Выборка.СуммаЗадолженности);
				ТЧДолжники.Добавить(Новый Структура("ФИОДолжника,ЛицевойСчет,АдресДолжника,СуммаЗадолженности,ПредставРасходы,ГосПошлина,НомерДокумента,ДатаВыдачиПриказа,ДатаВступВСилу,Ном",
				Должник.ФизЛицо,Выборка.ЛицевойСчет,АдресДолжника,СуммаЗадолженностиДляВывода,Выборка.ПредставРасходы,Выборка.ГосПошлина,
				Выборка.НомерДокумента,ДатаВыдачиПриказа,ДатаВступВСилу,Строка(Индекс)));
				СуммаГоспошлины = Выборка.ГосПошлина; 
				МассивСтрок.Добавить(ТЧДолжники[ТЧДолжники.Количество()-1]);
			КонецЕсли;
		КонецЦикла;
		Если НЕ ТекущийЛицевой = Выборка.ЛицевойСчет ИЛИ ТекущийЛицевой = Неопределено
			ИЛИ Выборка.НомерДокумента <> ТекущийНомерДокумента Тогда  
 
			Если МассивСтрок.Количество()>1 Тогда       
				ГосПошлина = Окр((СуммаГоспошлины / МассивСтрок.Количество()),2);
				Сч = 1;
				Для Каждого СтрокаПоЛС ИЗ МассивСтрок Цикл   
					//Если Сч = 1 Тогда
						СтрокаПоЛС.СуммаЗадолженности = Строка(СтрокаПоЛС.СуммаЗадолженности) + " солидарно";   
						СтрокаПоЛС.ПредставРасходы = Строка(СтрокаПоЛС.ПредставРасходы) + " солидарно";
					//Иначе
						//СтрокаПоЛС.АдресДолжника = "";
						//СтрокаПоЛС.НомерДокумента = "";
						//СтрокаПоЛС.СуммаЗадолженности = "";
						//СтрокаПоЛС.ПредставРасходы = "";  
						//СтрокаПоЛС.ДатаВыдачиПриказа ="";
					//КонецЕсли ;
					СтрокаПоЛС.ГосПошлина = ГосПошлина; 
					Сч = Сч + 1;
				КонецЦикла;
				МассивСтрок = Новый Массив;
				ТекущийЛицевой =  Выборка.ЛицевойСчет;        
				ТекущийНомерДокумента = Выборка.НомерДокумента;
				СуммаГоспошлины = 0;
			Иначе  
				МассивСтрок = Новый Массив;
				ТекущийЛицевой =  Выборка.ЛицевойСчет;     
				СуммаГоспошлины = 0;  
			КонецЕсли; 
		КонецЕсли;   
		Если ТекущийЛицевой = Неопределено Тогда    
			ТекущийЛицевой = Выборка.ЛицевойСчет;
		КонецЕсли;
		
	КонецЦикла;
	//ТЧДолжники.Сортировать("");
	//Если ВспомИндекс > 1 Тогда
	//	ГосПошлина = Окр((ГосПошлина / ТЧДолжники.Количество()),2);
	//	Для Счетчик = (ТЧДолжники.Количество()- ВспомИндекс)  по (ТЧДолжники.Количество()-1) Цикл
	//		Если Счетчик = (ТЧДолжники.Количество()- ВспомИндекс) ИЛИ ИмяМакета = "ПФ_DOCX_Сопроводительное" Тогда 
	//			ТЧДолжники[Счетчик].СуммаЗадолженности = Строка(ТЧДолжники[Счетчик].СуммаЗадолженности) + " солидарно";
	//			ТЧДолжники[Счетчик].ПредставРасходы = Строка(ТЧДолжники[Счетчик].ПредставРасходы) + " солидарно";
	//		Иначе
	//			ТЧДолжники[Счетчик].АдресДолжника = "";
	//			ТЧДолжники[Счетчик].НомерДокумента = "";
	//			ТЧДолжники[Счетчик].СуммаЗадолженности = "";
	//			ТЧДолжники[Счетчик].ПредставРасходы = "";
	//		КонецЕсли;
	//		ТЧДолжники[Счетчик].ГосПошлина = ГосПошлина;
	//	КонецЦикла;
	//КонецЕсли;
	
	ДанныеПечати = Новый Структура("Статус,Услуга,ТЧДолжники,ДатаДокумента,БанковскиеРеквизиты,ДатаВыдачиПриказа,ДатаВступВСилу",
	Статус,Услуга,ТЧДолжники,ДатаДокумента,БанковскиеРеквизиты,ДатаВыдачиПриказа,ДатаВступВСилу);
	Возврат ДанныеПечати;
	
КонецФункции

Функция ТекстЗапроса()
	Возврат "ВЫБРАТЬ
	        |	Банки.Наименование КАК НаименованиеБанка,
	        |	Банки.ИННБанка КАК ИННБанка,
	        |	Банки.ОКПОБанка КАК ОКПОБанка,
	        |	Банки.КППБанка КАК КППБанка,
	        |	Банки.ОГРНБанка КАК ОГРНБанка,
	        |	Банки.Адрес КАК АдресБанка,
	        |	лб_Тест_Дома.KR_RS КАК РасчетныйСчет,
	        |	бит_ИсполнительныйЛист.ФИОДолжника КАК ФИОДолжника,
	        |	бит_ИсполнительныйЛист.Адрес КАК АдресДолжника,
	        |	бит_ИсполнительныйЛист.СуммаДолгаПоУслугеПоРешениюСуда КАК СуммаЗадолженности,
	        |	Банки.Код КАК БИК,
	        |	бит_ИсполнительныйЛист.Дата КАК ДатаДокумента,
	        |	бит_ИсполнительныйЛист.ДатаИсполнительногоЛиста КАК ДатаИсполнительногоЛиста,
	        |	бит_ИсполнительныйЛист.ДатаВынесенияРешенияСуда КАК ДатаВыдачиПриказа,
	        |	бит_ИсполнительныйЛист.ДатаВступленияВЗаконнуюСилу КАК ДатаВступВСилу,
	        |	бит_ИсполнительныйЛист.НомерИсполнительногоЛиста КАК НомерДокумента,
	        |	бит_ИсполнительныйЛист.Статус КАК Статус,
	        |	бит_ИсполнительныйЛист.ЛицевойСчет КАК ЛицевойСчет,
	        |	бит_ИсполнительныйЛист.СуммаГоспошлиныПоРешениюСуда КАК ГосПошлина,
	        |	бит_ИсполнительныйЛист.СуммаПредставительскихРасходовПоРешениюСуда КАК ПредставРасходы,
	        |	бит_ИсполнительныйЛист.Услуга КАК Услуга,
	        |	бит_ИсполнительныйЛист.Ответчики.(
	        |		ФизЛицо КАК ФизЛицо
	        |	) КАК Ответчики,
	        |	Банки.КоррСчет КАК КоррСчет,
	        |	бит_ИсполнительныйЛист.ЛицевойСчет.Здание КАК Здание,
	        |	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК Квартира
	        |ИЗ
	        |	Документ.бит_ИсполнительныйЛист КАК бит_ИсполнительныйЛист
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	        |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	        |				ПО БанковскиеСчета.Банк = Банки.Ссылка
	        |			ПО лб_Тест_Дома.ЛицевойСчетКР = БанковскиеСчета.Ссылка
	        |		ПО бит_ИсполнительныйЛист.ЛицевойСчет.Здание = лб_Тест_Дома.Здание
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	        |		ПО бит_ИсполнительныйЛист.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	        |ГДЕ
	        |	бит_ИсполнительныйЛист.Ссылка В(&МассивСсылок)";
КонецФункции

//Проверяет относится ли услуга к капитальному ремонту
//НаименованиеУслуги - строка, наименование услуги
//Возвращает - ИСТИНА, если услуга относится к кап.ремонту
Функция КапитальныйРемонт(НаименованиеУслуги)
	Возврат СтрНайти(НРег(НаименованиеУслуги),"кап") > 0;
КонецФункции 

//Возвращает структуру содержащую Фамилию и инициалы подписанта, - из регистра сведений бит_ПодписантыПоИсполнительнымЛистам
//Мобильный и рабочий телефоны - из Контактной информации физического лица
//на дату ДатаДокумента
Функция Подписант(ДатаДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Подписанты.ФИО КАК Подписант
	|ПОМЕСТИТЬ ВТ_Подписант
	|ИЗ
	|	РегистрСведений.бит_ПодписантыПоИсполнительнымЛистам.СрезПоследних(&Период, ) КАК бит_Подписанты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК МобильныйТелефон,
	|	ВТ_Подписант.Подписант КАК Подписант
	|ПОМЕСТИТЬ ВТ_Мобильный
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подписант КАК ВТ_Подписант
	|		ПО ФизическиеЛицаКонтактнаяИнформация.Ссылка = ВТ_Подписант.Подписант
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Вид = &Мобильный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК РабочийТелефон,
	|	ВТ_Подписант.Подписант КАК Подписант
	|ПОМЕСТИТЬ ВТ_Рабочий
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Подписант КАК ВТ_Подписант
	|		ПО ФизическиеЛицаКонтактнаяИнформация.Ссылка = ВТ_Подписант.Подписант
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Вид = &Рабочий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Подписант.Подписант КАК Подписант,
	|	ВТ_Мобильный.МобильныйТелефон КАК МобильныйТелефон,
	|	ВТ_Рабочий.РабочийТелефон КАК РабочийТелефон
	|ИЗ
	|	ВТ_Подписант КАК ВТ_Подписант
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Мобильный КАК ВТ_Мобильный
	|		ПО ВТ_Подписант.Подписант = ВТ_Мобильный.Подписант
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рабочий КАК ВТ_Рабочий
	|		ПО ВТ_Подписант.Подписант = ВТ_Рабочий.Подписант";
	
	Запрос.УстановитьПараметр("Мобильный", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	Запрос.УстановитьПараметр("Рабочий", Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Подписант = Выборка.Подписант;
		ТелефонДляБанка = Выборка.МобильныйТелефон;
		ТелефонДляДолжников = Выборка.РабочийТелефон;
	КонецЕсли;
	Если ЗначениеЗаполнено(Подписант) Тогда
		Подписант = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Подписант.ФИО);
	Иначе
		Подписант = ""
	КонецЕсли;
	//Подписант = ФамилияИнициалы(Подписант);
	Результат = Новый Структура("Подписант,ТелефонДляБанка,ТелефонДляДолжников", Подписант,ТелефонДляБанка,ТелефонДляДолжников);
	Возврат Результат;
КонецФункции

//Возвращает дату установки последнего статуса Исполнительного листа
Функция ПолучитьДатуСтатуса(Ссылка, Статус)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист КАК Регистратор,
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	|	СтатусыПоИсполнительнымЛистамСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних(, ИсполнительныйЛист = &Ссылка И СтатусДокумента = &Статус) КАК СтатусыПоИсполнительнымЛистамСрезПоследних";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Статус",Статус);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Период;
	КонецЕсли;
КонецФункции

Функция ФамилияИнициалы(ФизЛицо)
	ФамилияИнициалы = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + ". " + Лев(ФизЛицо.Отчество, 1) + ".";
	Возврат ФамилияИнициалы;
КонецФункции


#КонецОбласти
